In [ ]:
import pandas as pd
df = pd.read_csv('employees.csv')#read csv file

In [2]:
df.head()

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30

In [3]:
df.tail()

   ID          Name Department  Age  Salary Joining_Date
5   6     Eva Green         HR   41   54000   2017-04-22
6   7    Mike Davis    Finance   50   90000   2016-08-19
7   8  Linda Taylor         IT   26   64000   2022-02-10
8   9  James Wilson  Marketing   38   70000   2020-09-08
9  10   Sarah Adams         HR   30   55000   2021-03-18

In [4]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            10 non-null     int64
 1   Name          10 non-null     str
 2   Department    10 non-null     str
 3   Age           10 non-null     int64
 4   Salary        10 non-null     int64
 5   Joining_Date  10 non-null     str
dtypes: int64(3), str(3)
memory usage: 612.0 bytes

In [5]:
df.describe()

             ID        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  35.300000  68300.000000
std     3.02765   7.958922  13106.826042
min     1.00000  26.000000  50000.000000
25%     3.25000  29.250000  57250.000000
50%     5.50000  33.000000  69000.000000
75%     7.75000  40.250000  74250.000000
max    10.00000  50.000000  90000.000000

In [6]:
df.describe(include=['object'])

C:\Users\Farouk sameh\AppData\Local\Temp\ipykernel_2196\3011300674.py:1: Pandas4Warning: For backward compatibility, 'str' dtypes are included by select_dtypes when 'object' dtype is specified. This behavior is deprecated and will be removed in a future version. Explicitly pass 'str' to `include` to select them, or to `exclude` to remove them and silence this warning.
See https://pandas.pydata.org/docs/user_guide/migration-3-strings.html#string-migration-select-dtypes for details on how to write code that works with pandas 2 and 3.
  df.describe(include=['object'])

            Name Department Joining_Date
count         10         10           10
unique        10          4           10
top     John Doe         HR   2020-05-21
freq           1          3            1

In [7]:
df

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30
5   6      Eva Green         HR   41   54000   2017-04-22
6   7     Mike Davis    Finance   50   90000   2016-08-19
7   8   Linda Taylor         IT   26   64000   2022-02-10
8   9   James Wilson  Marketing   38   70000   2020-09-08
9  10    Sarah Adams         HR   30   55000   2021-03-18

In [8]:
it=df[df['Department']=='IT']
it

   ID          Name Department  Age  Salary Joining_Date
1   2    Jane Smith         IT   34   75000   2019-06-12
3   4   Alice White         IT   29   72000   2021-01-04
7   8  Linda Taylor         IT   26   64000   2022-02-10

In [9]:
aged=df.sort_values(by='Age',ascending=False)
aged

   ID           Name Department  Age  Salary Joining_Date
6   7     Mike Davis    Finance   50   90000   2016-08-19
2   3    Bob Johnson    Finance   45   85000   2018-07-15
5   6      Eva Green         HR   41   54000   2017-04-22
8   9   James Wilson  Marketing   38   70000   2020-09-08
1   2     Jane Smith         IT   34   75000   2019-06-12
4   5  Charlie Brown  Marketing   32   68000   2019-11-30
9  10    Sarah Adams         HR   30   55000   2021-03-18
3   4    Alice White         IT   29   72000   2021-01-04
0   1       John Doe         HR   28   50000   2020-05-21
7   8   Linda Taylor         IT   26   64000   2022-02-10

In [ ]:
count=df['Department'].value_counts() #similiar to frequent but more general and much better
count

Department
HR           3
IT           3
Finance      2
Marketing    2
Name: count, dtype: int64

In [4]:
count=df['Department'].value_counts().sort_values()
count

Department
Marketing    2
Finance      2
IT           3
HR           3
Name: count, dtype: int64

In [5]:
df['Joining_Date'] = pd.to_datetime(df['Joining_Date'])

recent_joins = df[df['Joining_Date'] > '2020-01-01']

print("Employees Joined After 2020:\n")

recent_joins

Employees Joined After 2020:

   ID          Name Department  Age  Salary Joining_Date
0   1      John Doe         HR   28   50000   2020-05-21
3   4   Alice White         IT   29   72000   2021-01-04
7   8  Linda Taylor         IT   26   64000   2022-02-10
8   9  James Wilson  Marketing   38   70000   2020-09-08
9  10   Sarah Adams         HR   30   55000   2021-03-18

In [6]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            10 non-null     int64
 1   Name          10 non-null     str
 2   Department    10 non-null     str
 3   Age           10 non-null     int64
 4   Salary        10 non-null     int64
 5   Joining_Date  10 non-null     datetime64[us]
dtypes: datetime64[us](1), int64(3), str(2)
memory usage: 612.0 bytes

In [ ]:
recent_joins.to_csv('recent_joins.csv', index=False) #save to csv
print("Recent joins data saved to 'recent_joins.csv'")

Recent joins data saved to 'recent_joins.csv'

In [ ]:
pd